---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase
source: html/6820d2a3-d692-2d8e-cb69-d42060ace467.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayConduitRunBase

The base class for a cable tray or conduit run in Autodesk Revit.

## Syntax (C#)
```csharp
public class CableTrayConduitRunBase : Element
```